<article style="float:left;width:100%">
  <h1>致谢</h1>
  <p>说起模糊项目组来，大家口诛笔伐地认为这是老邪挖的坑。其实这岂止是坑啊，这算是万年坑了。从2008年开始摸索到现在已经过去6年多了，项目组的老成员从当初青涩的大一新生已经迈入了老博士的阶段，也从兰州大学开始走向天涯海角了。在这几年内，模糊也和大家一样不断地发生了蜕变，每一次蜕变不敢说是美的化身，但是至少算是一次奋力的羽化。</p>
  <p>追溯起校园模糊检索系统的根基，不得不谈到植物组常规活动。植物组常规活动成立于04年，是达协常规认知活动，也是达协特色活动之一。正是植物组不辍地耕耘兰大的每个角落，使得我们对整个榆中校区和本部的植物有了最初的了解。最初的植物名录来自于潘建斌师兄和蔡师兄整理的名录，收录了学校百种植物。其后，我的组长05级老唐在此基础上增补和修订了不少，大概有三百多种植物。在此期间，生命科学学院蒲训老师和冯虎元老师对植物组和模糊项目组进行了专业的指导，更正了我们之前的认识。正是他们的努力才使模糊检索系统有了科学的依据。</p>
  <p>至于模糊检索系统的搭建，离不开整个团队的努力。之前我们走了不少弯路，比如严刑拷打大家写科普版介绍（最终还是没有录用）。这些弯路中也包括自我的成长，比如我散漫的性格致使整个项目组无限拖延下去了。不过，大家还是包容了这些弯路，选择了一起做下去，才有了现在的模糊检索系统。</p>
  <p>模糊网站搭建全部出自空气之手，他的专业水平和耐心满足我们几乎所有不合理的要求。</p>
  <p>模糊网站的美工工作前期由豆豆和空气完成，他炉火纯青的PS功底让模糊的逼格陡然而起，同时也奠定了整个网页的风格。后期致谢页和模糊检索页则是由太白和常洁琼分别完成，使得模糊系统的核心内容终于完成。</p>
  <p>植物图片的来源绝大多数来自于潘建斌师兄和小猫，每次找潘师兄要照片都是有求必应，甚至把CFH中账号密码都给我了，让我自行下载。潘师兄的照片美观大方，植物学信息相当丰富。大受赞扬的模糊第一套明信片全部来自于潘师兄的大作，可见其照片的精美程度。而小猫常常和我们一起去山头、校园角落里面找植物，补拍了不少稀有的植物照片。其次，爪子、南极熊、荣嬷嬷、彤仔提供了以往的照片，使得我们的数据库更加完善。兔子和小西则是补拍后备力量，目前仍然在本部和榆中补拍照片。</p>
  <p>植物上传是最费时费力的工作，大概有近二十个人参与其中，年级跨越了06级到13级。特别是程程、蜗牛、木瓜后期还负责了复核工作。</p>
  <p>另外，不得不说的是，阿蒙、南极熊和爪子申请学校创新创业计划和GGF的项目支持，正是这些资金的支持，我们才有更多的选择空间和实力去完成模糊。</p>
  <p>当然，模糊还有很多背后的艰辛，这些都没有体现在模糊网站上。比如大概花费了大家两年多撰写的科普版介绍。比如，之前在兰大网页上建立的模糊试行版。比如，拍摄的大量照片等等。</p>
  <p>最后，我还想起了10年的夏天，兰州日温最高的时候，和阿蒙、小海怪、大黄、雪花等爬萃英山调查植物，阿蒙中暑的事情。我想模糊项目组也会给大家带来很多回忆吧。把模糊下个6年交给达协的新人吧。</p>
  <p>----老邪</p>

  <ul>
    <li>06级及以上：潘建斌师兄、老邪、老唐</li>
    <li>08级：阿蒙、南极熊、空气、小猫、球球、夏麦、彤仔、荣嬷嬷、呆呆、童童</li>
    <li>09级：程程、太白、宝宝、大黄、小海怪、小皖、茄子、华仔、雪花</li>
    <li>10级：爪子、小丁、豆豆、土豆、蜗牛、木瓜、梭罗、芒果</li>
    <li>11级：北泽、黑加仑、兔子、佐伊、英子</li>
    <li>12级：小西、小佐</li>
    <li>13级：锅块、小倩</li>
  </ul>
　　
  <ul>
    <li>网络构建：空气</li>
    <li>美工设计：豆豆、空气、太白、老邪、南极熊、常洁琼</li>
    <li>物种鉴定：潘建斌、老唐、老邪、南极熊、阿蒙、小西、小皖</li>
    <li>物种上传：阿蒙、南极熊、蜗牛、程程、球球、夏麦、彤仔、木瓜、太白、小丁、宝宝、爪子、北泽、锅块、小倩</li>
    <li>图片：潘建斌、小猫、兔子、小西、爪子、南极熊、荣嬷嬷、彤仔、刘拓、飞天、羽毛、老邪</li>
    <li>模糊选项设计：常洁琼</li>
    <li>花期：老邪、芒果、南极熊、彤仔</li>
    <li>物种审核：程程、蜗牛、木瓜、球球、夏麦</li>
  </ul>

  <p>鸣谢：兰州大学共青团委
      兰州大学社团联合会
      全球绿色资助基金会(GGF)中国青年组</p>
</article>
