<article style="float:left;width:100%">
  <h1>v2.1 (Sainfoin)</h1>
  <p>php+mysql架构，采用CodeIgniter框架，托管于新浪云服务，网址：<a href="http://plantsearch.sinaapp.com/" target="_blank">http://plantsearch.sinaapp.com/</a></p>
  <p>该版本对数据库也进行大幅重构，根据检索方式依然在不断完善中。</p>

  <h2>2014-07-11 01:00 Build:93</h2>
  <ul>
    <li>把“登陆”改为“登录”。</li>
    <li>添加修改植物图片描述的功能。</li>
  </ul>

  <h2>2013-09-29 22:45 Build:91</h2>
  <ul>
    <li>在首页添加GGF的图标。</li>
  </ul>

  <h2>2013-09-02 23:11 Build:90</h2>
  <ul>
    <li>对专业检的主要界面中的拉丁名应用斜体规则。</li>
  </ul>

  <h2>2013-09-02 23:06 Build:89</h2>
  <ul>
    <li>对专业检的主要界面进行美化。</li>
  </ul>
  
  <h2>2013-09-02 00:56 Build:88</h2>
  <ul>
    <li>实现专业检索的基本功能，界面待美化。</li>
  </ul>
  
  <h2>2013-08-17 00:08 Build:87</h2>
  <ul>
    <li>修复添加植物时，“属”选择显示“科”一级的分类阶元的bug。</li>
    <li>添加/删除植物时，“属”选择改为显示学名+中文名的组合。</li>
    <li>增加分类阶元的删除功能。</li>
    <li>对显示字体进行优化（英文Times New Roman优先，中文微软雅黑优先）。</li>
  </ul>
  <h2>2013-08-12 14:15 Build:85</h2>
  <ul>
    <li>分类阶元列表展示页面中，引入属拉丁名斜体功能。</li>
  </ul>
  <h2>2013-08-02 00:10 Build:84</h2>
  <ul>
    <li>修复上传植物照片时引发的warning。</li>
  </ul>
  <h2>2013-07-21 00:47 Build:83</h2>
  <ul>
    <li>植物详情页面中，图片缩略图暂且改为按描述排序，后续将改成可以自由调整排序。</li>
  </ul>
  <h2>2013-07-15 23:41 Build:81</h2>
  <ul>
    <li>实现模糊检索功能。</li>
  </ul>
  <h2>2013-07-08 23:41 Build:80</h2>
  <ul>
    <li>修复增加/修改分类阶元时出错的bug。</li>
  </ul>
  <h2>2013-06-26 00:40 Build:79</h2>
  <ul>
    <li>建立专业检索页面。</li>
    <li>添加/修改植物信息时，增加“属”字段，并且采用输入自动提示结合下拉框选择的方式，方便录入。</li>
  </ul>
  <h2>2013-06-20 23:10 Build:78</h2>
  <ul>
    <li>上传照片时自动生成各尺寸缩略图，并自动裁剪为宽高比1:1。</li>
  </ul>
  <h2>2013-06-15 21:59 Build:77</h2>
  <ul>
    <li>修复增加/修改植物时，经常出现“提交失败”的bug。</li>
    <li>修复修改植物时，“检索特征”页填写内容清空的bug。</li>
    <li>增加上传植物时，在“植物信息”、“检索特征”、“图片管理”之间直接跳转的链接。</li>
    <li>增加“无主”植物（导入数据后无上传者的植物）的“认领”功能——具有上传权限的用户均可对“无主”植物进行修改，修改后该植物的上传者自动变更为该修改者。</li>
  </ul>
  <h2>2013-06-15 23:21 Build:76</h2>
  <ul>
    <li>重构植物添加页面，改为向导式。</li>
    <li>重新梳理添加、修改、审核植物的权限。</li>
    <li>修改分类阶元（界门纲目科属种）的管理界面。</li>
  </ul>
  <h2>2013-06-04 20:08 Build:75</h2>
  <ul>
    <li>植物编辑权限改为只需要上传权限。</li>
    <li>解决植物展示页面缩略图大小显示bug。</li>
    <li>解决编辑植物信息时学名字段显示拼音的bug。</li>
  </ul>
  <h2>2013-06-04 Build:74</h2>
  <ul>
    <li>增加图片管理功能（需要上传权限），除了新增图片，还可以删除图片，设置图片为植物封面。</li>
    <li>解决植物展示页面缩略图拉伸变形问题。</li>
  </ul>
  <h2>2013-06-02 Build:73</h2>
  <ul>
    <li>解决增加植物时部分不选时的报错。</li>
    <li>花期增加“无花”选项。</li>
    <li>增加删除植物功能，需要审核权限。</li>
    <li>图片上传页面增加格式和大小要求提示。</li>
  </ul>
  <h2>2013-05-30 Build:72</h2>
  <ul>
    <li>增加植物审核功能：上传的植物需要经过审核后才会在前台检索到。</li>
    <li>权限梳理，目前的权限分为上传、审核、管理三种。</li>
  </ul>
  <h2>2013-05-29 Build:71</h2>
  <ul>
    <li>为物种图片添加备注（编号），并显示在物种展示页面的缩略图中。</li>
    <li>专业介绍增加“资料来源”字段。</li>
    <li>花期的录入改为起始月份与结束月份的选取。</li>
    <li>常见度改为取值1-5的下拉框选取。</li>
    <li>学名字段中，录入时用花括号“{}”括起来的部分显示为斜体，其他为正体。</li>
  </ul>
  <h2>2013-05-16 Build:70</h2>
  <ul>
    <li>登陆页面美工。</li>
    <li>页首页尾美工。</li>
    <li>css代码冲突处理。</li>
  </ul>
  <h1>v2.0 (Dandelion)</h1>
  <p>php+mysql架构，采用Smarty框架，托管于新浪云服务，网址：<a href="http://2.plantsearch.sinaapp.com/" target="_blank">http://2.plantsearch.sinaapp.com/</a></p>
  <p>由于是直接从1.0版本移植过来的，Smarty框架的代码也略显繁冗，因此再次重构，开发2.1版本。</p>
  <h1>v1.0 (Clover)</h1>
  <p>ASP+Access架构，托管于兰州大学网络中心虚拟主机，网址：<a href="http://darwin.lzu.edu.cn/plant-search/" target="_blank">http://darwin.lzu.edu.cn/plant-search/</a></p>
</article>
